[
  {
    "id": "1",
    "name": "Shrimp Ceviche",
    "category": "Mexican",
    "details": "Easy Shrimp Ceviche (Ceviche de Camarón)! It's bursting with flavor and perfectly refreshing. Serve it as a chip dip or as a main entree over crispy tostada shells.",
    "ingredients": "shrimp, lime juice, lemon juice, tomatoes, red onion, cilantro, jalapeno, salt, pepper, cucumber, avocado, tostada, valentina",
    "hasMeat": true,
    "hasDairy": false,
    "hasFish": true,
    "hasGluten": false,
    "cookTime": "1",
    "prepTime": "20",
    "marinadeTime": "30",
    "servings": "6",
    "imgUrl": "https://www.cookingclassy.com/wp-content/uploads/2020/09/ceviche-6-180x180.jpg",
    "recipeUrl": "https://www.cookingclassy.com/ceviche/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li>1 1/4 lbs. medium shrimp, peeled, deveined and tails removed</li><li>1/3 cup fresh lime juice</li><li>1/3 cup fresh lemon juice</li><li>2 medium roma tomatoes, diced (1 cup)</li><li>3/4 cup chopped red onion</li><li>1/2 cup chopped cilantro</li><li>1 medium jalapeno pepper,* seeded if preferred for less heat, diced</li><li>Salt and pepper, to taste</li><li>1/2 medium cucumber, peeled and diced (about 1 cup)</li><li>1 medium avocado, diced</li></ul>",
    "instructions": "<ol><li>Bring a pot of water to a boil. Meanwhile, fill up a medium bowl with ice water, set aside.</li><li>Add shrimp to boiling water and let cook just until pink and opaque, about 1 minute.</li><li>Drain shrimp in a colander then transfer to ice water to cool for a few minutes. Drain well then chop shrimp intosmall pieces (about 1/2-inch).</li><li>In a medium non-reactive bowl (you can use the same bowl that was previously filled with ice water) combine shrimp, lime juice, lemon juice, tomatoes, onion, cilantro, jalapeno pepper and season with salt and pepper to taste.</li><li>Transfer to refrigerator and let rest 30 minutes to 1 hour.</li><li>Toss in cucumber and avocado and serve (if desired you can strain off some of the juices). It's delicious with tortilla chips or over tostada shells.</li></ol>",
    "notes": "<ul><li>A serrano pepper can be used for a spicier option. Or add 1 Tbsp Mexican hot sauce (such as Tapatio, Valentina or Cholula).</li><li>Lean white fish can be used in place of shrimp (such as cod, talapia, mahi mahi, snapper, bass, halibut). Cut into chunks and cook through for safest option before using.</li></ul>"
  },
  {
    "id": "2",
    "name": "Mapo Tofu",
    "category": "Chinese",
    "details": "Spicy, delicious mapo tofu is usually made with ground pork, but for this vegan recipe, we use chopped shiitake mushrooms and haven't sacrificed any umami!",
    "ingredients": "tofu, mushroom, garlic, green onion, corn starch, rice, salt, sugar, chili, sriracha, water",
    "hasMeat": false,
    "hasDairy": false,
    "hasFish": false,
    "hasGluten": false,
    "cookTime": "15",
    "prepTime": "10",
    "servings": "4",
    "imgUrl": "https://thewoksoflife.com/wp-content/uploads/2019/12/vegan-mapo-tofu-17.jpg",
    "recipeUrl": "https://thewoksoflife.com/vegan-mapo-tofu/",
    "ingredientsHtml": "<ul><li> 4 tablespoons vegetable oil </li><li> 1 1/2 tablespoons Sichuan peppercorns (coarsely ground, reserve 1/4 teaspoon for garnish at the end) </li><li> 3 tablespoons ginger (finely minced) </li><li> 3 tablespoons garlic (finely minced) </li><li> 1 tablespoon fermented black beans </li><li> 1-2 Thai bird chilies (thinly sliced) </li><li> 4 ounces shiitake mushrooms (110g, finely chopped) </li><li> 1-2 tablespoons spicy bean sauce (depending on your desired salt/spice levels) </li><li> 1 tablespoon chili oil </li>” <li> 2/3 cup water (or vegetable or mushroom broth) </li> <li> 2 teaspoons cornstarch (mixed with 1 tablespoon water) </li> <li> 1 pound silken tofu (or soft tofu, 450g, cut into 1-inch cubes) </li> <li> 1/4 teaspoon sesame oil </li><li> 1/4 teaspoon sugar </li><li> 1 scallion (finely chopped) </li></ul>",
    "instructions": "<ol> <li> In a wok over medium low heat, add the vegetable oil and ground Sichuan peppercorns (remember to reserve ¼ teaspoon for garnishing the dish at the end). </li><li> Cook for 30 seconds, and add the ginger. Cook for another 1 minute and add the garlic. Cook for another 1 minute. Add the black beans, and chilies. Cook for another 1-2 minutes. </li><li> Turn up the heat to medium, and add the mushrooms. Cook until the mushrooms are cooked down and slightly caramelized, about 5 minutes. </li><li> Add the spicy bean sauce and chili oil to the mixture and stir it in well. Turn up the heat to high, and add ⅔ cups water or broth and stir. Bring the mixture up to a simmer, and allow to bubble for 1 minute. </li><li> Stir the cornstarch and water mixture to make sure the cornstarch is dissolved, and add it to the sauce. Allow the sauce to thicken (if it gets too thick, splash in more water or stock). If the sauce is too thin, make a little more cornstarch slurry and add it in. There will be variations depending on how high your heat is. </li><li> Add the tofu to the wok and gently toss the tofu in the sauce. Allow the tofu to simmer for 3-5 minutes, and then add the sesame oil, sugar, and scallions. </li><li> Give everything a final stir, and taste for seasoning (you likely won’t have to add any additional salt, as the spicy bean sauce and fermented black beans are quite salty). Serve, garnished with a last sprinkle of Sichuan peppercorn powder. </li></ol>",
    "notes": "NONE"
  },
  {
    "id": "3",
    "name": "Yakizuke Salmon",
    "category": "Japanese",
    "details": "A dish commonly prepared by fisherman ",
    "ingredients": "salmon, green onion, bell pepper, kombu, mirin, vegetable oil, soy sauce, ponzu, rice vinegar, rice wine, corn starch",
    "hasMeat": true,
    "hasDairy": false,
    "hasFish": true,
    "hasGluten": false,
    "cookTime": "15",
    "prepTime": "10",
    "marinadeTime": "20",
    "servings": "4",
    "imgUrl": "https://cookingwithdog.com/wp-content/uploads/2017/02/salmon-yakizuke-00-1024x576.jpg",
    "recipeUrl": "https://cookingwithdog.com/recipe/salmon-yakizuke/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 4 piece, Salmon lightly salted </li><li> 4 tsp, Sake </li><li> Cake Flour or All Purpose Flour </li><li> 112 cm, Long Green Onions (Naganegi) </li><li> 2, Green Bell Peppers (Piman) cut into bite size pieces </li><li> Vegetable Oil </li><li> 4 tbsp, Sake </li><li> 4 tbsp, Mirin </li><li> 4 tbsp, Vinegar </li><li> 2 tbsp, Yuzu Juice or any type of sour citrus juice </li><li> 4 sheet, Dashi Kombu Seaweed 5x5cm/2\"x2\" </li><li> Dried Red Chili Pepper sliced into rings </li><li> 1 tsp, Soy Sauce </li></ul>",
    "instructions": "<ol><li> Let’s make the marinade. In a small pot, combine the sake and the mirin. Turn on the burner. Bring it to a boil and let the alcohol evaporate until you can’t smell it anymore. Pour the mixture onto a plate. </li><li> Add the vinegar, yuzu citrus juice, dashi kombu seaweed, dried red chili pepper and soy sauce. You can use any type of sour citrus juice instead of the yuzu juice. Stir to mix. </li><li> Make numerous cuts along the long green onion diagonally. The small cuts will help it to absorb the flavor and also help soften the texture. Then, cut the onion into 4cm (1.6\") pieces. As for the bell pepper, cut it the same size as the onion. </li><li> Let’s make the Salmon Yakizuke. Add the sake to the salmon. And coat both sides evenly. </li><li> Add the vegetable oil to a pan. Turn on the burner and add the long green onion and the bell pepper. Stir-fry the vegetables. You can also use asparagus, snap peas, onion or mushrooms instead. </li><li> Now, the vegetables are deliciously browned. Place them into the marinade. </li><li> With a paper towel, remove the moisture from the salmon. Then, using a mesh strainer, sprinkle all purpose flour on both sides. This will help to create a nicely browned surface and also absorb the marinade.</li><li> Add oil again and reheat the pan. Place the salmon into the pan. Saute the top side first so that you can present a beautifully browned surface. Occasionally shake the pan to brown evenly. Cover and saute on low heat. </li><li> When the bottom is golden brown, flip it over. Brown the other side. You can also grill the salmon to give the skin a crisp texture, making the dish more delicious. Now, it is ready. </li><li> Place the salmon onto the plate. Spoon the marinade over the ingredients and let them sit until cool. </li><li> Now, the Yakizuke has absorbed the flavor. Place the kombu seaweed and a piece of long green onion onto a plate. Then, lean the salmon against them. </li><li> Garnish with the bell pepper and the long green onion. Finally, spoon the marinade over the salmon. </li></ol>",
    "notes": "<ul><li> You can enjoy the dish immediately or keep it in the fridge for several hours to help it absorb more delicious flavor. </li><li> The kombu seaweed did an excellent job! The dish absorbed the flavor well and it goes great with steamed rice. </li></ul>"
  },
  {
    "id": "4",
    "name": "Taiwanese Popcorn Chicken",
    "category": "Chinese",
    "details": "Fried delicious chunks of chicken!",
    "ingredients": "chicken, salt, black pepper, sugar, corn starch, basil, soy sauce, chilil, hoisin sauce, garlic, egg",
    "hasMeat": true,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": false,
    "cookTime": "10",
    "prepTime": "5",
    "marinadeTime": "30",
    "servings": "2",
    "imgUrl": "https://i0.wp.com/soupeduprecipes.com/wp-content/uploads/2019/09/taiwanese-popcorn-chicken.png?resize=225%2C127&ssl=1",
    "recipeUrl": "https://soupeduprecipes.com/taiwanese-popcorn-chicken/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 2 tbsp of Sichuan peppercorn </li><li> 1 tbsp of white pepper </li><li> 2 tbsp of salt </li><li> 500 grams of chicken breast </li><li> 1 tbsp of soy sauce </li><li> 1 + 1/4 tsp of salt </li><li> 3 cloves of garlic </li><li> 1 tsp of ginger </li><li> 1 tsp of five-spice powder </li><li> a shake of onion powder </li><li> 1 egg white </li><li> 2 tbsp of all-purpose flour </li><li> Orange juice from 1/4 of an orange 1.5-2 tbsp </li><li> 1 cup of sweet potato starch </li><li> A hand full of basil leaves </li><li> Chili flakes optional </li><li> Few shakes of the salt and pepper that we made </li></ul>",
    "instructions": "<ol><li> Make the Chinese salt and pepper: Toast 2 tbsp of Sichuan peppercorn, 1 tbsp of white peppercorn, and 1.5 tbsp of salt on a cast-iron skillet. Grind them in a blender. </li><li> Store the Jiao Yan in a sealed container. It will last a couple of months at room temperature. </li><li> Cut the chicken breast into about 2/3 inch cubes. </li><li> Marinade it with 1 tbsp of soy sauce, 1 tsp + 1/4 tsp of salt, 1 tsp of five-spice powder, 3 cloves of garlic, 1 tsp of grated ginger, a few shakes of onion powder, 2 tbsp of all-purpose flour. Crack in 1 egg white. The last ingredient is my secret: fresh juice from 1/4 of an orange. </li><li> Mix until everything is well combined. Cover it, let’s it sit for 15 minutes. Do not let it sit for too long or else the enzyme will over tenderize the meat. </li><li> Normally, people use bread crumbs to create that crunchy outside layer. Today we are using sweet potato starch - the thick version. It is still sweet potato starch but comes in a chunkier form. That makes the popcorn chicken extra crunchy and it is gluten-free. Cornstarch and regular potato starch are a great replacement for sweet potato starch. </li><li> You can use a spray bottle to turn the powder form starch into the thick chunky form. Super simple, I showed how to do that in my sesame chicken recipe: https://youtu.be/C2CVlvSSFO4. </li><li> We will need 1 cup of sweet potato starch. Get a clean bowl. Cover the bottom with a layer of sweet potato starch. Then add in the chicken. Not all of them, just 10- 12 pieces depends on how big your bowl is. Slightly dust more sweet potato starch to cover the chicken. Use chopsticks to stir it a little bit so they can be coated well. If you see 2 pieces are sticking together, go ahead and separate them. Toss it a few times. It is gonna be a little dusty but it is way faster compared coating the chicken piece by piece. </li><li> Take out the chicken. Make sure to shake off the excess starch. Put it away. There will be some starch left in the bowl. Just use that for the next batch. </li><li> Once you finished everything, let them sit for 10 to 15 minutes so the coating has enough time to bond together. </li><li> During this time, we gonna start heating the to 350 degrees Fahrenheit. Add in the chicken. Don’t put them all in one time because you don’t want to crowd the wok. Or else it will take forever for them to get crispy and by that time, the chicken is already dry out. So definitely fry them in batches. Gently push them so they don’t stick together. </li><li> After you add the chicken, the temperature will drop a little bit. Keep frying them at medium heat and wait until the temperature rise back up to 35It will take a few minutes. </li><li> During this time, prepare a hand full of basil. The leaves look pretty clean so I am not going to wash them or else it will be hard to dry them completely. </li><li> Go back and check the chicken. It should become a light golden color. Let’s see the temperature, it should around 35If you don’t have a thermometer, you can just go by color. These chicken pieces are so small, you can’t go wrong with it. At this point, I am going to quickly add in the basil. Block the oil splashing with a lid and wait for the intense bubbling to stop. I will suggest frying the basil for less than 10 seconds in total or else you will burn them. </li><li> Turn off the heat, take everything out. There will be some little crunchy bits left in the wok. Get a strainer to fish them out and fry the next batch. You probably need to fry everything in 3 batches. Normally, I will double fry the chicken but I not doing that today because we are using chicken breast and the pieces are so small. We don’t want the chicken to be dry on the inside. If you use chicken thigh and you cut the pieces bigger, you can double fry it so the crunchiness last longer. </li><li> Serve the popcorn chicken with some Jiao Yan. Add a few shakes of chili flake. Enjoy! </li></ol>",
    "notes": "NONE"
  },
  {
    "id": "5",
    "name": "Sous Vide Ribeye",
    "category": "American",
    "details": "Ribeye that melts in your mouth and cooked perfectly!",
    "ingredients": "ribeye, salt, black pepper, thyme, rosemary, vegetable oil",
    "hasMeat": true,
    "hasDairy": false,
    "hasFish": false,
    "hasGluten": true,
    "cookTime": "5",
    "prepTime": "120",
    "servings": "2",
    "imgUrl": "https://prods3.imgix.net/images/articles/2017_03/Feature-Sous-Vide-Rib-Eye-Steak.jpg?auto=format%2Ccompress&dpr=1.5&ixjsv=2.2.3&q=66&w=750 ",
    "recipeUrl": "https://recipes.anovaculinary.com/recipe/ribeye-steak-time-and-temp",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 1 1/2-to 2-pounds / 680 to 900 grams bone-in or 1 to 1 1/2-pounds / 450 to 680 grams) boneless steaks (1 large ribeye) </li><li> Kosher salt and freshly ground black pepper to taste </li><li> 2 fresh thyme sprigs (optional) </li><li> 2 fresh rosemary sprigs (optional) </li><li> 1 tablespoon / 15 ml vegetable, canola, or rice bran oil </li><li> 1 tablespoon / 15 ml unsalted butter </li><li> 3 to 4 fresh thyme sprigs (optional) </li><li> 3 to 4 fresh rosemary sprigs (optional) </li><li> 1 small shallot, sliced (optional) </li><li> 2 whole cloves garlic, smashed (optional) </li><li> Coarse sea salt (such as Maldon) to finish </li></ul> ",
    "instructions": "<ol><li> Pre-heat your Precision Cooker to the desired final temperature according to the charts in the Anova app. Allow the water bath to come to temperature before adding your steak. </li><li> If you're planning on cooking and eating them immediately, season generously with salt and pepper then slide it into a vacuum sealer or heavy-duty plastic bag. If sealing now to freeze or cook for later, omit the salt and pepper (it will get added later on). </li><li> If using aromatics like thyme or rosemary sprigs, add a few to the bag now, distributing them evenly on both sides of the steak. </li></ol>",
    "notes": "<ul><li> Sous vide is the ideal way to cook steak for perfectly even edge-to-edge cooking with foolproof results.</li><li> Sous vide steaks can be finished in a pan or on the grill. Highly marbled cuts like a grain-finished Prime-grade ribeye and strip should be cooked a few degrees Fahrenheit higher than leaner steaks like tenderloin, since their copious intramuscular fat helps keep them moist while delivering plenty of flavor. </li></ul> "
  },
  {
    "id": "6",
    "name": "Tinga",
    "category": "Mexican",
    "details": "Best Tinga De Pollo you will ever find out there.",
    "ingredients": "chicken, oil, onion, tomatoes, chipotle, garlic, salt, oregano, thyme, marjoram, pepper ",
    "hasMeat": true,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": true,
    "servings": "2",
    "imgUrl": "https://www.thebossykitchen.com/wp-content/uploads/2018/01/Authentic-Mexican-Tinga-de-Pollo-Chicken-in-Chipotle-Tomato-Sauce55.jpg.webp",
    "recipeUrl": "https://www.thebossykitchen.com/authentic-mexican-tinga-de-pollo-chicken-chipotle-tomato-sauce/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 3-4 medium size chicken breast </li><li> 4-5 tablespoons of oil (I used olive oil) </li><li> 1-2 large onions sliced </li><li> 4-5 medium Roma(plum)tomatoes </li><li> 1 can of Chipotle chiles in Adobo </li><li> 2-3 cloves of garlic </li><li> 1 1/2 teaspoon salt, or to taste </li><li> 1/4 teaspoon Mexican oregano </li><li> 1/4 teaspoon dried thyme </li><li> 1/4 teaspoon dried marjoram </li><li> 1/4 teaspoon black pepper </li></ul>",
    "instructions": "<ol> <li> Bring a pot of water and salt to a boil and add the chicken breast to cook. Allow the chicken breast to simmer until it is cooked through. </li><li> This is a basic recipe, but you can add other things to the pot, an onion cut in quarters, some Mexican dried oregano, 1-2 garlic cloves. Make sure you skim the foam that forms on top of the water as it starts simmering. </li><li> Prepare the other ingredients. While the chicken is cooking, slice the onions. </li><li> Heat up the oil in a large pan and add the onion. </li><li> Cook the onion until soft and translucent for about 5-6 minutes. The authentic Mexican chicken tinga has lots of onions that give sweetness and flavor to the dish, so if you do not love onions, this dish might not be for you. </li><li> Place the tomatoes in a medium saucepan, cover with water, bring to a simmer over medium-high heat and cook for 8 to 10 minutes, or until the tomatoes are soft and mushy but not falling apart. </li><li> In a blender(affiliate link), place the tomatoes, garlic, salt, pepper and 2-3 chiles chipotle from the can.</li><li> Mix the salsa with the onions. Add oregano, marjoram, thyme. </li><li> Mexican oregano(affiliate link) is the traditional spice, so feel free to add or skip the marjoram and the thyme entirely if you don’t like them. </li><li> Let it simmer on low heat while you take the chicken out of the water. Be careful as the sauce will steam and bubble. </li><li> Stir occasionally, partially covered, until the sauce becomes darker and thicker. </li><li> Shred the chicken </li><li> You can also use two forks for this operation. </li><li> Add the chicken to the salsa and mix. </li><li> Taste again for salt and pepper. Let it simmer for only a minute so the ingredients get acquainted with each other.  </li><li> THE TRADITIONAL WAY TO EAT THIS DISH IS WITH WHITE RICE. </li><li> However, feel free to serve it hot on warm corn or flour tortillas, with sliced avocados, shredded lettuce, Mexican crema (or sour cream if you don’t have access to the Mexican one), fresh onion, etc. </li></ol>",
    "notes": "<ul><li> If you already have cooked chicken or even rotisserie chicken in the fridge, use that one. You will put dinner on the table faster. If not, continue with the recipe. </li><li> Be careful with the chiles. The original Mexican recipe calls for the entire can of Chipotle, but I found it to be too powerful and spicy for us, so I added fewer chiles in the blender. </li><li> This recipe is very suitable for a picnic, potluck, or even tailgating, as you can make it in advance and serve it warm from a crockpot. </li></ul> "
  },
  {
    "id": "7",
    "name": "Torta",
    "category": "Mexican",
    "details": "a Mexican food classic.",
    "ingredients": "bolillo, mayo, ham, tomato, lettuce, jalapeno, avocado",
    "hasMeat": true,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": true,
    "prepTime": "5",
    "servings": "1",
    "imgUrl": "https://inmamamaggieskitchen.com/wp-content/uploads/2018/03/Torta-de-Jamon-Mexican-Ham-Sandwich.jpg",
    "recipeUrl": "https://inmamamaggieskitchen.com/torta-de-jamon-mexican-ham-sandwich/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 1 telera or bolillo, sliced in half </li><li> 1 tablespoon mayonnaise </li><li> 2 slices ham </li><li> 2 slices tomatoes </li><li> 1 leaf lettuce thinly sliced </li><li> Pickled jalapeños as many as you like </li><li> Avocado slices optional </li></ul>",
    "instructions": "<ol> <li> Cut bread in half. </li><li> Smear mayo on one side of the bread. </li><li> To the bottom half of the bread, add ham, tomato, lettuce, jalapenos, and avocado (if using). </li><li> Top with other half of the bread. </li><li> You can toast the sandwich for a few minutes on each side over a hot griddle. </li><li> Or skip altogether the toasting part, and enjoy! </li></ol>",
    "notes": "<ul><li> Torta de Jamón is a Mexican Ham Sandwich served on a telera or bolillo </li><li> You start with either a telera or bolillo. If you can’t find either of these Mexican breads, you can also use a baguette. </li><li> You can toast the bread at the end. </li></ul>"
  },
  {
    "id": "8",
    "name": "Espagueti Verde",
    "category": "Mexican",
    "details": "Learn to make this authentic and delicious Mexican recipe",
    "ingredients": "poblano pepper, tomatillo, cilantro, spinach, cream cheese, sour cream, garlic, onion, ground cumin, chicken stock, salt, spaghetti, oil, mozzarella cheese",
    "hasMeat": false,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": true,
    "cookTime": "10",
    "prepTime": "15",
    "servings": "16",
    "imgUrl": "https://www.mylatinatable.com/wp-content/uploads/2020/05/Espagueti-Verde-1-1024x681.jpg.webp",
    "recipeUrl": "https://www.mylatinatable.com/mexican-spaghetti-with-creamy-poblano-sauce-espagueti-verde/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 3 Poblano Peppers </li><li> 3 Tomatillos </li><li> 1/2 Bunch of Cilantro </li><li> 1 Cup Spinach </li><li> 3 Oz cream cheese </li><li> 1 can Media Crema </li><li> 3 cloves Garlic </li><li> 1/4 Onion </li><li> 1/4 tsp ground cumin </li><li> 1/4 cup chicken stock </li><li> Salt to taste</li><li> 1 package Spaghetti cooked according to package instructions </li><li> 1.25 tbsp oil </li><li> 1 cup mozzarella cheese </li></ul>",
    "instructions": "<ol> <li> Start by roasting the poblano peppers in a frying pan or comal over high heat until they are almost black on the outside. Add to a sealed plastic bag and let sweat for about 10 minutes. Remove from the bag and holding the peppers under a stream of cold water, remove the skin and the seeds. Set aside </li><li> Sautee the onion, spinach, tomatillo, and garlic with a tablespoon of oil in a hot frying pan. </li><li> Take the ingredients from the previous step and add them to a blender with the poblano peppers, chicken stock, cilantro, crema, cream cheese, salt, and cumin. Blend until smooth. </li><li> Add the blended sauce to a hot pan with a teaspoon of oil and bring to a boil and then lower heat to medium and let simmer for 5 minutes. Add more salt or chicken stock as needed to taste. </li><li> Combine the sauce with the spaghetti and mix well. Add to an oven safe, top with mozzarella cheese, and bake or broil until the cheese is melted. </li></ol>",
    "notes": "NONE"
  },
  {
    "id": "9",
    "name": "Alfredo Pasta",
    "category": "Italian",
    "details": "To Die For Fettuccine Alfredo",
    "ingredients": "fettuccine pasta, salt, pepper, butter, heavy cream, romano cheese, parmesan cheese",
    "hasMeat": true,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": true,
    "cookTime": "15",
    "prepTime": "15",
    "servings": "6",
    "imgUrl": "https://therecipecritic.com/wp-content/uploads/2016/01/homemadealfredosauce-650x975.jpg",
    "recipeUrl": "https://www.allrecipes.com/recipe/23431/to-die-for-fettuccine-alfredo/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 24 ounces dry fettuccini pasta </li><li> 1 cup butter </li><li> ¾ pint heavy cream </li><li> salt and pepper to taste </li><li> 1 dash garlic salt </li><li> ¾ cup grated Romano cheese </li><li> ½ cup grated Parmesan cheese </li></ul>",
    "instructions": "<ol><li> Bring a large pot of lightly salted water to a boil. Add fettuccini and cook for 8 to 10 minutes or until al dente; drain. </li><li> In a large saucepan, melt butter into cream over low heat. Add salt, pepper and garlic salt. Stir in cheese over medium heat until melted; this will thicken the sauce. </li><li> Add pasta to sauce. Use enough of the pasta so that all of the sauce is used and the pasta is thoroughly coated. Serve immediately. </li></ol>",
    "notes": "NONE"
  },
  {
    "id": "10",
    "name": "Fried Rice",
    "category": "Chinese",
    "details": "it’s SO flavorful and delicious!",
    "ingredients": "rice, egg, carrots, onion, green onion, peas, garlic, soy sauce, oyster sauce, toasted sesame oil, butter",
    "hasMeat": true,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": true,
    "cookTime": "10",
    "prepTime": "5",
    "servings": "4-6",
    "imgUrl": "https://www.gimmesomeoven.com/wp-content/uploads/2017/07/How-To-Make-Fried-Rice-Recipe-2-1.jpg ",
    "recipeUrl": "https://www.gimmesomeoven.com/fried-rice-recipe/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 3 tablespoons butter, divided </li><li> 2 eggs, whisked </li><li> 2 medium carrots, peeled and diced </li><li> 1 small white onion, diced </li><li> 1/2 cup frozen peas </li><li> 3 cloves garlic, minced </li><li> salt and black pepper </li><li> 4 cups cooked and chilled rice (I prefer short-grain white rice) </li><li> 3 green onions, thinly sliced </li><li> 3–4 tablespoons soy sauce, or more to taste </li><li> 2 teaspoons oyster sauce (optional) </li><li> 1/2 teaspoons toasted sesame oil </li></ul>",
    "instructions": "<ol><li> Heat 1/2 tablespoon of butter in a large sauté pan* over medium-high heat until melted. Add egg, and cook until scrambled, stirring occasionally. Remove egg, and transfer to a separate plate. </li><li> Add an additional 1 tablespoon butter to the pan and heat until melted. Add carrots, onion, peas and garlic, and season with a generous pinch of salt and pepper. Sauté for about 5 minutes or until the onion and carrots are soft. Increase heat to high, add in the remaining 1 1/2 tablespoons of butter, and stir until melted. Immediately add the rice, green onions, soy sauce and oyster sauce (if using), and stir until combined. Continue sautéing for an additional 3 minutes to fry the rice, stirring occasionally.  (I like to let the rice rest for a bit between stirs so that it can crisp up on the bottom.)  Then add in the eggs and stir to combine. Remove from heat, and stir in the sesame oil until combined.  Taste and season with extra soy sauce, if needed. </li><li> Serve immediately, or refrigerate in a sealed container for up to 3 days. </li></ol>",
    "notes": "<ul><li> *Sauté pan: If you happen to own a nonstick or cast-iron pan, I would recommend it for this recipe.  But that said, any pan that you have can work — you may just have to be a bit more vigilant with stirring so that the rice and eggs don’t stick. </li></ul>"
  },
  {
    "id": "11",
    "name": "Spicy Beef & Pepper Stir-Fry",
    "category": "Chinese",
    "details": "Think of this stir-fry as your chance to play with heat and spice.",
    "ingredients": "beef, ginger, garlic, pepper, salt, coconut milk, sugar, sriracha, lime zest, lime juice, canola oil, sweet red pepper, red onion, jalapeno, baby spinach, green onion, cilantro",
    "hasMeat": true,
    "hasDairy": false,
    "hasFish": false,
    "hasGluten": true,
    "cookTime": "10",
    "prepTime": "20",
    "servings": "4",
    "imgUrl": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps186044_TH153340B09_25_3b-2.jpg?fit=700,1024",
    "recipeUrl": "https://www.tasteofhome.com/recipes/spicy-beef-pepper-stir-fry/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 1 pound beef top sirloin steak, cut into thin strips </li><li> 1 tablespoon minced fresh gingerroot </li><li> 3 garlic cloves, minced, divided </li><li> 1/4 teaspoon pepper </li><li> 3/4 teaspoon salt, divided </li><li> 1 cup light coconut milk </li><li> 2 tablespoons sugar </li><li> 1 tablespoon Sriracha chili sauce </li><li> 1/2 teaspoon grated lime zest </li><li> 2 tablespoons lime juice </li><li> 2 tablespoons canola oil, divided </li><li> 1 large sweet red pepper, cut into thin strips </li><li> 1/2 medium red onion, thinly sliced </li><li> 1 jalapeno pepper, seeded and thinly sliced </li><li> 4 cups fresh baby spinach </li><li> 2 green onions, thinly sliced </li><li> 2 tablespoons chopped fresh cilantro </li></ul>",
    "instructions": "<ol> <li> In a large bowl, toss beef with ginger, 2 garlic cloves, pepper and 1/2 teaspoon salt; let stand 15 minutes. In a small bowl, whisk coconut milk, sugar, chili sauce, lime zest, lime juice and remaining salt until blended. </li><li> In a large skillet, heat 1 tablespoon oil over medium-high heat. Add beef; stir-fry until no longer pink, 2-3 minutes. Remove from pan. </li><li> Stir-fry red pepper, red onion, jalapeno and remaining garlic in remaining oil just until vegetables are crisp-tender, 2-3 minutes. Stir in coconut milk mixture; heat through. Add spinach and beef; cook until spinach is wilted and beef is heated through, stirring occasionally. Sprinkle with green onions and cilantro. </li></ol>",
    "notes": "NONE"
  },
  {
    "id": "12",
    "name": "Chicken Biryani",
    "category": "Indian",
    "details": "Wonderfully aromatic and flavorful, it's sure to be a hit at your dinner table!",
    "ingredients": "chicken, yogurt, curry powder, cinnamon, butter, yellow onion, garlic, ginger, salt, chicken broth, cilantro, raisins, basmati rice, cilantro, almonds",
    "hasMeat": true,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": true,
    "cookTime": "25",
    "prepTime": "5",
    "servings": "4",
    "imgUrl": "https://www.daringgourmet.com/wp-content/uploads/2014/05/Chicken-Biryani-2-square-350x350.jpg",
    "recipeUrl": "https://www.daringgourmet.com/easy-indian-chicken-biryani/#recipe",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 2 large skinless, boneless chicken breasts , cut into bite-sized pieces (or use thighs for more flavor) </li><li> ½ cup whole plain yogurt </li><li> 3 tablespoons quality curry powder </li><li> ¼ teaspoon cinnamon </li><li> 3 tablespoons butter </li><li> 1 medium yellow onion , chopped </li><li> 1 tablespoon minced garlic </li><li> 1 tablespoon minced fresh ginger root </li><li> 1 teaspoon salt </li><li> ¼ cup chicken broth </li><li> 2 tablespoons fresh chopped cilantro </li><li> 2-3 tablespoons raisins </li><li> 2 cups cooked basmati rice (parboiled, i.e. only three-fourths cooked, slightly \"al dente\") </li><li> Chopped cilantro and sliced almonds for garnish </li></ul>",
    "instructions": "<ol><li> Combine the chicken in a bowl with the yogurt, curry powder, and cinnamon and let marinate for at least 1 hour but preferably at least 4 hours. </li><li> Heat the butter in a skillet over medium-high heat and cook the onions until golden, 7-8 minutes. Add the garlic and ginger and cook for another 2 minutes. Add the chicken and all of the marinade along with the salt. Stir to combine, reduce the heat to medium-low, cover, and cook until the chicken is cooked through, 6-7 minutes, stirring occasionally. </li><li> Stir in the rice, cilantro and raisins. Pour the chicken broth over the mixture. Cover and simmer for 3-4 minutes until the rice is soft and the mixture is heated through. Add salt to taste. Serve immediately. </li></ol>",
    "notes": "NONE"
  },
  {
    "id": "13",
    "name": "Dal",
    "category": "Indian",
    "details": "Dahl lentil curry is outrageously delicious.",
    "ingredients": "ghee, cayenne chillies, onion, garlic, ginger, curry leaves, tomato, cumin, chana dal, water, turmeric powder, garam marsala, salt",
    "hasMeat": false,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": false,
    "cookTime": "90",
    "prepTime": "15",
    "Soaking Time": "60",
    "servings": "3-4",
    "imgUrl": "https://www.recipetineats.com/wp-content/uploads/2018/07/Dal_2.jpg",
    "recipeUrl": "https://www.recipetineats.com/dal-indian-lentil-curry/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 2 tbsp / 30 g ghee , or 1 tbsp oil + 1 tbsp/15g butter</li><li> 2 green cayenne chillies , deseeded and cut into chunks (optional) </li><li> 1 medium onion , finely chopped (brown or yellow) </li><li> 6 garlic cloves , finely chopped </li><li> 1 tbsp ginger , finely chopped (1.5cm / 3/5\") </li><li> 8 fresh curry leaves , or 6 dried </li><li> 1 tomato , chopped </li><li> 1/2 tsp ground cumin </li><li> 1 cup dried chana dal , yellow split peas or other yellow lentils </li><li> 4 cups / 1 litre water </li><li> 1/2 tsp turmeric powder </li><li> 1/8 tsp garam marsala </li><li> 3/4 tsp salt </li></ul>",
    "Optional Ingredients": "“<ul style=\"list-style-type:none;\"><li> 1 1/2 tbsp / 20g ghee , or half each butter + oil (Note 1) </li><li> 1 eschalot or 1/4 small onion , halved lengthways and sliced </li><li> 1 tsp cumin seeds </li><li> 1/2 tsp black mustard seeds (optional) </li><li> 3 dried chillies , broken in half, seeds removed (optional) </li><li> Fresh coriander/cilantro sprigs (optional) </li><li> Steamed basmati rice </li></ul>”",
    "instructions": "<ol><li> Soak Lentils: Rinse lentils and leave to soak in plenty of water for 1 hour. Drain in colander. </li><li> Heat ghee/oil in a heavy based saucepan over high heat. Add green chillies and fry for a minute until starting to blister. </li><li> Add onions and fry until softened. </li><li> Lower heat to medium, add garlic, ginger and curry leaves. Cook for 1 minute until garlic starts to turn golden and smells amazing. </li><li> Add tomatoes and cumin, cook until tomatoes start to break down and thicken to a paste - about 2 minutes.</li><li> Add lentils, water, tumeric and salt. Stir, bring to simmer, cover and simmer gently for 1 hour. Stir two or three times during the hour. </li><li> Remove lid and simmer gently for 30 minutes to thicken, stirring every now and then. The dal is ready when it has a consistency like porridge - some lentils should be intact but some have broken down to thicken the sauce. </li><li> Stir through garam masala at the end. Adjust salt if desired.</li><li> Pour over Tadka, if using, and stir through. </li><li> Serve Dal over rice, garnished with a sprig of coriander if desired. </li></ol>",
    "notes": "<ul><li> Ghee is clarified butter and it's the main fat used in Indian cooking. Sold in the international section of Coles and other major Australian supermarkets. Otherwise, use equal parts butter + vegetable oil. </li><li> The green chillies sold at supermarkets in Australia are cayenne green chillies. </li><li> Curry leaves really add an extra something-something to curries. Find them in the fresh herb section of Australian supermarkets or find dried in the dried herbs and spice section. </li><li> LENTILS: I use chana dal here for its shape and texture - sold in the international section of some Coles supermarkets. Any yellow dal such as channa dal, toor dal or moong dal can be used in this recipe.  </li><li> If you cannot get hold of chana dal, yellow split peas are a terrific substitution but only use 3 cups of water and cook for 40 minutes covered and 30 minutes uncovered.</li></ul>"
  },
  {
    "id": "14",
    "name": "Lamb Rogan Josh",
    "category": "Indian",
    "details": "Rogan Josh is one of the heavy hitters at Indian restaurants",
    "ingredients": "lamb, chicken broth, onion, tomato, yogurt, ghee, garlic, ginger, cinnamon, cardamom, cloves, paprika, chili, cumin, coriander, garam masala, fennel, nutmeg, turmeric",
    "hasMeat": true,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": false,
    "cookTime": "150",
    "prepTime": "20",
    "servings": "4",
    "imgUrl": "https://www.recipetineats.com/wp-content/uploads/2020/02/Rogan-Josh_4.jpg ",
    "recipeUrl": "https://www.recipetineats.com/rogan-josh/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 3.5 tbsp ghee , substitute butter </li><li> 1 cinnamon stick </li><li> 6 green cardamom pods , lightly bruised </li><li> 4 cloves </li><li> 1 large onion , finely chopped </li><li> 3 cloves garlic , finely minced </li><li> 1 tbsp ginger , finely grated </li><li> 5 tbsp tomato passata (US: tomato puree/sauce, Note 5) </li><li> 1 tsp salt </li><li> 750g/1.5lb boneless lamb shoulder , cut into 3cm/1.2\" cubes (Note 6) </li><li> 1.5 cups / 375ml chicken stock , salt reduced (broth) </li><li> 2 tbsp paprika , normal or sweet </li><li> 3/4 tsp chilli powder</li><li> 4 tsp ground coriander </li><li> 4 tsp ground cumin </li><li> 2 tsp turmeric powder </li><li> 1/4 tsp nutmeg </li><li> 1 tsp garam marsala</li><li> 1/2 tsp fennel powder</li><li> 1/2 tsp extra garam masala</li><li> 1/2 tsp extra fennel powder </li><li> 1/2 cup / 125g plain yoghurt (Greek yogurt fine) </li><li> Chopped coriander leaves, finely shredded ginger, yogurt </li><li> Basmati rice </li></ul>",
    "instructions": "<ol><li> Melt ghee over medium heat in large heavy based pot. Add cinnamon, cardamom and cloves and cook for one minute. </li><li> Add onion and cook for 7 minutes, stirring frequently, until pieces are golden and starting the brown on the edges. </li><li> Add the garlic and ginger, cook for another minute. </li><li> Stir in the Spices, cook for 30 seconds. </li><li> Mix in the tomato puree and salt, then add stock and mix. </li><li> Add lamb, stir, bring to simmer. </li><li> Place lid on and adjust heat to low or medium low so it's simmering gently. </li><li> Cook 1 hour 45 minutes, giving it an occasional stir, until lamb is quite tender - use 2 forks to check, it should pry apart pretty easily. </li><li> Remove lid, and continue cooking for another 15 minutes (to reduce sauce slightly) - lamb should be very tender by this stage. </li><li> Stir in the Yogurt, the Extra garam marsala and fennel. Cook for another few minutes. </li><li> Serve with basmati rice, sprinkled with fresh coriander leaves and other garnishes if desired. More sides (pictured): Cucumber salad (Note 7) and Easy naan - No Yeast Flatbread </li></ol>",
    "notes": "<ul><li> Ghee is pure butter (butter is actually fat + water), has more intense butter flavour than normal butter. Sold at large grocery stores in Australia, sub with butter. </li><li> Garam masala - Indian spice mix sold at large grocery stores nowadays. Sub with curry powder. </li><li> Storage and reheating - Keeps up to 5 days in the fridge, or 3 months in the freezer. Like all stews and braises, it's even better the next day! Reheat on the stove or in the microwave. If it seems a little thick, loosen with stock if you have some left, else just water. Adjust seasoning if required – sometimes they need a small salt bump the next day. </li></ul>"
  },
  {
    "id": "15",
    "name": "Lazy Lasagna",
    "category": "italian",
    "details": "Feeling lazy? well you're in luck. ",
    "ingredients": "lasagna noodles, ricotta cheese, mozzarella cheese, parmesan cheese, pasta sauce with meat",
    "hasMeat": true,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": true,
    "cookTime": "15",
    "prepTime": "15",
    "servings": "6",
    "imgUrl": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Weeknight-Lazy-Lasagna_EXPS_SDDJ18_110233_B08_08_3b-5.jpg?fit=700,1024 ",
    "recipeUrl": "https://www.tasteofhome.com/recipes/weeknight-lazy-lasagna/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 8 ounces uncooked lasagna noodles, broken into 2-inch pieces </li><li> 1 cup ricotta cheese </li><li> 1 cup shredded mozzarella cheese, divided </li><li> 1/3 cup grated Parmesan cheese </li><li> 1 jar (24 ounces) pasta sauce with meat </li></ul>",
    "instructions": "<ol><li> Preheat oven to 400°. Cook lasagna noodles according to package directions. Meanwhile, in a large bowl, mix ricotta cheese, 1/2 cup mozzarella cheese and Parmesan cheese. Drain noodles well; stir into cheese mixture. </li><li> Spread 1 cup pasta sauce into a greased 11x7-in. baking dish. Layer with half of the noodle mixture and 1 cup sauce; layer with the remaining noodle mixture and sauce. Sprinkle with remaining cheese. </li><li> Cover with greased foil; bake until heated through, 10-15 minutes. </li></ol>",
    "notes": "<ul><li> This is the perfect recipe to use up broken lasagna noodles, but other pasta shapes like mafalde or bowtie can be used, too. </li><li> For easy spinach lasagna, add a couple layers of fresh baby spinach (no chopping or pre-cooking required). </li></ul>"
  },
  {
    "id": "16",
    "name": "Giant Meatball Sub",
    "category": "italian",
    "details": "A hearty party sandwich!",
    "ingredients": "eggs, whole milk, onion, garlic, bread crumbs, salt, italian seasoning, italian sausage, spaghetti sauce, french bread, mozzarella cheese, parmesan cheese",
    "hasMeat": true,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": true,
    "cookTime": "30",
    "prepTime": "15",
    "servings": "8",
    "imgUrl": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Giant-Meatball-Sub_exps17780_GB143373D01_15_2bC_RMS-3.jpg?fit=700,1024 ",
    "recipeUrl": "https://www.tasteofhome.com/recipes/giant-meatball-sub/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 2 large eggs, lightly beaten </li><li> 1/3 cup whole milk </li><li> 1 medium onion, chopped </li><li> 2 garlic cloves, minced </li><li> 1 cup soft bread crumbs </li><li> 1/2 teaspoon salt </li><li> 1/2 teaspoon Italian seasoning </li><li> 1-1/4 pounds bulk Italian sausage </li><li> 2 jars (26 ounces each) spaghetti sauce </li><li> 1 loaf (1 pound) unsliced French bread, halved lengthwise </li><li> 8 slices part-skim mozzarella cheese </li><li> Shredded Parmesan cheese, optional </li></ul>",
    "instructions": "<ol><li> In a large bowl, combine the eggs, milk, onion, garlic, bread crumbs, salt and Italian seasoning. Crumble sausage and beef over mixture; mix well. </li><li> Shape into 1-in. balls. Place meatballs on a greased rack in a shallow baking pan. Bake at 425° for 15 minutes or until browned; drain. </li><li> In a Dutch oven, heat the spaghetti sauce over medium heat. Add meatballs; simmer for 15 minutes. Meanwhile, bake bread at 325° for 10 minutes or until heated through. </li><li> Place mozzarella cheese on bottom half of bread; spoon meatballs onto cheese. Replace top. Slice sandwich into serving-size portions; serve with extra spaghetti sauce and, if desired, Parmesan cheese. </li></ol>",
    "notes": "<ul><li> To make soft bread crumbs, tear bread into pieces and place in a food processor or blender. Cover and pulse until crumbs form. One slice of bread yields 1/2 to 3/4 cup crumbs. </li></ul>"
  },
  {
    "id": "17",
    "name": "Blushing Penne Pasta",
    "category": "italian",
    "details": "This recipe is a real winner!",
    "ingredients": "penne pasta, butter, onion, thyme, basil, salt, half and half cream, chicken broth, tomato, all purpose flour, parmigiano reggiano cheese",
    "hasMeat": true,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": true,
    "cookTime": "15",
    "prepTime": "15",
    "servings": "8",
    "imgUrl": "https://everylittlecrumb.com/wp-content/uploads/pinksaucepasta2-683x1024.jpg ",
    "recipeUrl": "https://www.tasteofhome.com/recipes/blushing-penne-pasta/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 1 package (16 ounces) penne pasta </li><li> 2 tablespoons butter </li><li> 1 medium onion, halved and thinly sliced </li><li> 2 tablespoons minced fresh thyme or 2 teaspoons dried thyme </li><li> 2 tablespoons minced fresh basil or 2 teaspoons dried basil </li><li> 1 teaspoon salt </li><li> 1-1/2 cups half-and-half cream, divided </li><li> 1/2 cup white wine or reduced-sodium chicken broth </li><li> 1 tablespoon tomato paste </li><li> 2 tablespoons all-purpose flour </li><li> 1/2 cup shredded Parmigiano-Reggiano cheese, divided </li></ul>",
    "instructions": "<ol><li> In a 6-qt. stockpot, cook pasta according to package directions. Drain; return to pot. </li><li> Meanwhile, in a large nonstick skillet, heat butter over medium heat; saute onion until lightly browned, 8-10 minutes. Add herbs and salt; cook and stir 1 minute. Add 1 cup cream, wine and tomato paste; cook and stir until blended. </li><li> Mix flour and remaining cream until smooth; gradually stir into onion mixture. Bring to a boil; cook and stir until thickened, about 2 minutes. Stir in 1/4 cup cheese. Stir into pasta. Serve with remaining cheese. </li</ol>",
    "notes": "NONE"
  },
  {
    "id": "18",
    "name": "Baked Salmon",
    "category": "American",
    "details": "This moist, flavorful, and flakey baked salmon is what weeknight dinners are all about!",
    "ingredients": "salmon, butter, parsley, dill, salt, pepper, lemon, garlic",
    "hasMeat": true,
    "hasDairy": true,
    "hasFish": true,
    "hasGluten": false,
    "cookTime": "15",
    "prepTime": "5",
    "servings": "4",
    "imgUrl": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2021/01/Baked-Salmon-8-450x450.jpg",
    "recipeUrl": "https://downshiftology.com/recipes/best-baked-salmon/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 4 (6-ounce) salmon fillets </li><li> 2 tablespoons butter, melted </li><li> 1/2 tablespoon lemon juice, plus more lemon slices for garnish </li><li> 3 garlic cloves, minced </li><li> salt and pepper </li><li> 1 teaspoon finely chopped parsley </li><li>1 teaspoon finely chopped dill </li></ul>",
    "instructions": "<ol> <li> Preheat your oven to 375F/190C and let the salmon come to room temperature for 15 minutes. Mix together the melted butter and lemon juice (I use the juice from 1/4 slice of lemon) in a small bowl. Then, place the salmon in baking dish and brush the butter mix all over. </li><li> Top the salmon with the minced garlic, salt, and pepper, and bake for 12-15 minutes, or until cooked through. </li><li> Sprinkle the fresh parsley and dill on the salmon before serving. </li></ol>",
    "notes": "<ul><li> If you're dairy-sensitive you can use ghee or a light brush with olive oil as well. </li></ul>"
  },
  {
    "id": "19",
    "name": "Tuna Salad",
    "category": "American",
    "details": "Tuna salad is a light and fresh comfort food classic.",
    "ingredients": "canned tuna, mayo, celery, red onion, parsley, dijon mustard, salt, pepper",
    "hasMeat": true,
    "hasDairy": false,
    "hasFish": true,
    "hasGluten": false,
    "cookTime": "0",
    "prepTime": "15",
    "servings": "4",
    "imgUrl": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2020/04/Tuna-Salad-4.jpg",
    "recipeUrl": "https://downshiftology.com/recipes/tuna-salad/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 2 (5-ounce) cans tuna </li><li> 1/4 cup mayonnaise </li><li> 1 stalk of celery, diced </li><li> 2 tablespoons red onion, diced </li><li> 1-2 tablespoons chopped parsley, chives and/or other herbs </li><li> 1/2 tablespoons Dijon mustard </li><li> salt and pepper, to taste </li></ul>",
    "instructions": "<ol><li> Drain the liquid from the tuna cans. Then, add the tuna, mayonnaise, diced celery, diced red onion, herbs, Dijon mustard, salt and pepper to a mixing bowl. </li><li> Stir all of the ingredients together until well combined. </li><li> Enjoy the tuna salad plain out of a bowl, wrapped up in lettuce, or in a sandwich. </li></ol>",
    "notes": "<ul><li> If you’d like a creamier texture you can always add more mayonnaise. </li></ul> "
  },
  {
    "id": "20",
    "name": "Baked Chicken Breast ",
    "category": "American",
    "details": "Perfectly baked chicken breasts that are juicy, tender, easy, and oh so flavorful! ",
    "ingredients": "chicken, olive oil, paprika, garlic powder, thyme, salt, pepper",
    "hasMeat": true,
    "hasDairy": false,
    "hasFish": false,
    "hasGluten": false,
    "cookTime": "20",
    "prepTime": "5",
    "servings": "4",
    "imgUrl": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2021/01/Baked-Chicken-Breasts-10-450x450.jpg",
    "recipeUrl": "https://downshiftology.com/recipes/baked-chicken-breasts/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 4 boneless skinless chicken breasts </li><li> 1 tablespoon olive oil , or avocado oil </li><li> 1 teaspoon kosher salt </li><li> 1 teaspoon paprika </li><li> 1/2 teaspoon garlic powder </li><li> 1/2 teaspoon dried thyme, or oregano, parsley or other herbs </li><li> 1/4 teaspoon freshly ground black pepper </li></ul>",
    "instructions": "<ol><li> Preheat your oven to 425F/220C. In a small bowl, mix together the paprika, garlic powder, thyme, salt and pepper until combined. </li><li> Lightly coat the chicken breasts in olive oil, and then generously rub the spice mix on both sides of the chicken. </li><li> Place the chicken breasts in a baking dish and cook for 20-25 minutes, depending on size (see chart above). Let the chicken rest for a few minutes to allow the juices to redistribute within the meat, then serve. </li></ol>",
    "notes": "NONE"
  },
  {
    "id": "21",
    "name": "Broccoli Salad",
    "category": "American",
    "details": "A salad recipe that unexpectedly will knock your socks off!",
    "ingredients": "broccoli, bacon, red onion, dried cranberries, sunflower seeds, goat cheese ",
    "hasMeat": true,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": false,
    "cookTime": "15",
    "prepTime": "5",
    "servings": "6",
    "imgUrl": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2019/02/Broccoli-Salad-3.jpg",
    "recipeUrl": "https://downshiftology.com/recipes/broccoli-salad/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li>1 broccoli head, approx 5 cups of florets </li><li> 8 slices bacon </li><li> 1/3 cup red onion, diced </li><li> 1/2 cup dried cranberries </li><li> 1/2 cup sunflower seeds </li><li> 1/4 cup goat cheese, crumbled </li><li> 1/2 cup mayonnaise </li><li> 1/4 cup plain yogurt </li></ul>",
    "instructions": "<ol><li> Preheat the oven to 400 degrees fahrenheit. Add the bacon slices to a parchment lined baking tray and cook for 15 minutes or until crispy. Remove the bacon from the oven and transfer to a paper towel to dry and cool. </li><li> While the bacon is cooking, slice off all the broccoli florets and make sure they're in bite-sized pieces. Add them to a large mixing bowl along with the red onion, dried cranberries, sunflower seeds and goat cheese.</li><li> To make the dressing, add the mayonnaise and yogurt to a small bowl and stir together. Add the dressing to the mixing bowl and stir until everything is well combined. </li></ol>",
    "notes": "<ul><li> Make sure you've sliced the broccoli florets into small, bite-sized pieces. It makes it far easier to eat that way. </li><li> If you're wondering what to do with the broccoli stem, spiralize it!  </li></ul>"
  },
  {
    "id": "22",
    "name": "Egg Salad",
    "category": "American",
    "details": "The classic egg salad recipe that can be eaten plain with a fork or turned into a delicious sandwich (or wrap).",
    "ingredients": "egg, mayo, dijon mustard, red onion, lemon juice, parsley, chives ",
    "hasMeat": true,
    "hasDairy": false,
    "hasFish": false,
    "hasGluten": false,
    "cookTime": "15",
    "prepTime": "10",
    "servings": "4",
    "imgUrl": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2019/04/Egg-Salad-4-450x450.jpg",
    "recipeUrl": "https://downshiftology.com/recipes/egg-salad/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 6 eggs, room temperature </li><li> 1/4 cup red onion, finely diced </li><li> 1/4 cup mayonnaise </li><li> 1 tbsp Dijon mustard </li><li> 2 tbs parsley, finely diced </li><li> 2 tbs chives, finely diced </li><li> 1 tsp lemon juice </li><li>salt and pepper, to taste </li></ul>",
    "instructions": "<ol><li> Bring a pot of water to a boil. Then turn the heat to low so there's no bubbles. Use a skimmer to slowly and gently place the eggs in the pot. Turn the heat back to high and boil the eggs for 12 minutes.  </li><li> Transfer the eggs to an ice water bath for a few minutes to stop the cooking process and cool. </li><li> Once your eggs are cool to touch, peel and discard the eggs shells. Cut the hard boiled eggs to your desired size (I prefer chunky). Then add the eggs, red onion, chives, parsley, mayonnaise, Dijon mustard, and lemon juice to bowl and stir all ingredients together. </li><li> Season with salt and pepper and serve in a bowl, in a sandwich, or in a wrap. </li></ol>",
    "notes": "<ul><li> The eggs may crack if you introduce cold eggs straight to the boiling hot water. So I  leave my eggs out prior to boiling, or run them under lukewarm water for a few seconds, as well as turn off the boil right before you introduce the eggs. </li><li> You can store egg salad for up to 3-4 days in the fridge. </li></ul>"
  },
  {
    "id": "23",
    "name": "Garlic Butter Shrimp",
    "category": "American ",
    "details": "Juicy, flavorful, and the perfect weeknight meal.",
    "ingredients": "butter, large shrimp, salt, pepper, garlic, lemon, parsley",
    "hasMeat": true,
    "hasDairy": true,
    "hasFish": true,
    "hasGluten": false,
    "cookTime": "5",
    "prepTime": "5",
    "servings": "6",
    "imgUrl": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2019/08/Garlic-Butter-Shrimp-2-450x450.jpg",
    "recipeUrl": "https://downshiftology.com/recipes/garlic-butter-shrimp/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li> 3 tablespoons butter (or ghee), plus more, as desired </li><li> 1 1/2 pounds large shrimp </li><li> 1 teaspoon salt </li><li> 1 teaspoon pepper </li><li> 4-5 cloves garlic , minced </li><li> 1 lemon, juiced </li><li> chopped parsley , to garnish </li></ul>",
    "instructions": "<ol><li> Melt the butter in a skillet over medium high heat and then stir in the garlic. Cook this for about 30 seconds. </li><li> Add the shrimp to the skillet and season it with salt and pepper. Cook the shrimp for about 2-3 minutes on each side or until the shrimp begins to turn pink. </li><li> Take the shrimp off the heat and stir in the lemon juice. If you'd like it extra buttery, you can add more butter now as well. </li><li> Garnish with freshly chopped parsley and serve. </li></ol>",
    "notes": "<ul><li> When it comes to shrimp, do your best to not overcook them. That's when they become rubbery. </li></ul>"
  }
]