[
  {
    "name": "Shrimp Ceviche",
    "category": "Mexican",
    "details": "Easy Shrimp Ceviche (Ceviche de Camarón)! It's bursting with flavor and perfectly refreshing. Serve it as a chip dip or as a main entree over crispy tostada shells.",
    "ingredients": "[shrimp, lime juice, lemon juice, tomatoes, red onion, cilantro, jalapeno, salt, pepper, cucumber, avocado, tostada, valentina]",
    "hasMeat": true,
    "hasDairy": false,
    "hasFish": true,
    "hasGluten": false,
    "cookTime": "1",
    "prepTime": "20",
    "marinadeTime": "30",
    "servings": "6",
    "imgUrl": "https://www.cookingclassy.com/wp-content/uploads/2020/09/ceviche-6-180x180.jpg",
    "recipeUrl": "https://www.cookingclassy.com/ceviche/",
    "ingredientsHtml": "<ul style=\"list-style-type:none;\"><li>1 1/4 lbs. medium shrimp, peeled, deveined and tails removed</li><li>1/3 cup fresh lime juice</li><li>1/3 cup fresh lemon juice</li><li>2 medium roma tomatoes, diced (1 cup)</li><li>3/4 cup chopped red onion</li><li>1/2 cup chopped cilantro</li><li>1 medium jalapeno pepper,* seeded if preferred for less heat, diced</li><li>Salt and pepper, to taste</li><li>1/2 medium cucumber, peeled and diced (about 1 cup)</li><li>1 medium avocado, diced</li></ul>",
    "instructions": "<ol><li>Bring a pot of water to a boil. Meanwhile, fill up a medium bowl with ice water, set aside.</li><li>Add shrimp to boiling water and let cook just until pink and opaque, about 1 minute.</li><li>Drain shrimp in a colander then transfer to ice water to cool for a few minutes. Drain well then chop shrimp intosmall pieces (about 1/2-inch).</li><li>In a medium non-reactive bowl (you can use the same bowl that was previously filled with ice water) combine shrimp, lime juice, lemon juice, tomatoes, onion, cilantro, jalapeno pepper and season with salt and pepper to taste.</li><li>Transfer to refrigerator and let rest 30 minutes to 1 hour.</li><li>Toss in cucumber and avocado and serve (if desired you can strain off some of the juices). It's delicious with tortilla chips or over tostada shells.</li></ol>",
    "notes": "<ul><li>A serrano pepper can be used for a spicier option. Or add 1 Tbsp Mexican hot sauce (such as Tapatio, Valentina or Cholula).</li><li>Lean white fish can be used in place of shrimp (such as cod, talapia, mahi mahi, snapper, bass, halibut). Cut into chunks and cook through for safest option before using.</li></ul>"
  },
  {
    "name": "Mapo Tofu",
    "category": "Asian",
    "ingredients": "[tofu, mushrooms, garlic, green onions, cornstarch, rice, salt, sugar, chili oil, chili bean paste, sriracha, water]",
    "details": "Really good food.",
    "hasMeat": false,
    "hasDairy": false,
    "hasFish": false,
    "hasGluten": false
  },
  {
    "name": "Yakizuke Salmon",
    "category": "Asian",
    "ingredients": "[salmon, mushrooms, garlic, green onions, cornstarch, rice, salt, sugar, chili oil, chili bean paste, sriracha, water]",
    "details": "Salmon is amazing.",
    "hasMeat": true,
    "hasDairy": false,
    "hasFish": true,
    "hasGluten": false
  },
  {
    "name": "Taiwanese Popcorn Chicken",
    "category": "Asian",
    "ingredients": "[chicken, cheese, mushrooms, garlic, green onions, cornstarch, rice, salt, sugar, chili oil, chili bean paste, sriracha, water]",
    "details": "Popcorn chicken rocks.",
    "hasMeat": false,
    "hasDairy": true,
    "hasFish": false,
    "hasGluten": false
  },
  {
    "name": "Sous Vide Ribeye",
    "category": "American",
    "ingredients": "[ribeye, mushrooms, wheat, garlic, green onions, cornstarch, rice, salt, sugar, chili oil, chili bean paste, sriracha, water]",
    "details": "Steaks are great",
    "hasMeat": true,
    "hasDairy": false,
    "hasFish": false,
    "hasGluten": true
  }
]
